Depth_5L/system/probes1



type probes;

libs ("libsampling.so");

writeControl timeStep;
writeInterval 1; 
fields 
    (
        U
    ); 

probeLocations
    (
        (0.004 0.013 0.0) 
        (0.004 0.013 0.005) 
        (0.004 0.013 0.01) 
        (0.004 0.013 0.015) 
        (0.004 0.013 0.02) 
        (0.004 0.013 0.025) 
        (0.004 0.013 0.03) 
        (0.004 0.013 0.035) 
        (0.004 0.013 0.04) 
        (0.004 0.013 0.045) 
        // (0.004 0.07 0.0) 
        // (0.04 0.07 0.0)
        // (0.1 0.07 0.0)
    );
