Depth_5L/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);

